OdDAI.Select.getAggr(OdDAI.Aggr**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a pointer to Aggr.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getEnum(OdDAI.EnumValueInfo*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value into OdDAI::EnumValueInfo that holds underlying enumeration string value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getEnum(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as pointer to constant char that holds underlying enumeration string value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getEnum(OdDAI.Enum**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as pointer to underlying enumeration instance.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getBINARY(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a binary value.
\param res [out] A placeholder for the raw pointer that refers to the binary data. This pointer is returned to a calling subroutine.
\returns Returns true if the value is successfully converted and the raw pointer is returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getDoubleArray(OdArray&lt;System.Double,OdObjectsAllocator&lt;System.Double&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as an array of double values.
\param res [out] A placeholder for the array to be filled and returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getHandleArray(OdArray&lt;OdDAIObjectId,OdObjectsAllocator&lt;OdDAIObjectId&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as an array of object identifiers.
\param res [out] A placeholder for the array to be filled and returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getInt32Array(OdArray&lt;System.Int32,OdObjectsAllocator&lt;System.Int32&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as an array of unsigned 32-bit integer values.
\param res [out] A placeholder for the array to be filled and returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getBINARY(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a binary value.
\param res [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getLogical(OdDAI.Logical*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a logical value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getHandleId
\details
Retrieves the current handle of object identifier.
\returns Returns the current value converted into OdDbHandle.
\remarks
The handle returned by the method is read-only.

OdDAI.Select.getHandle
\details
Retrieves the current value as an object identifier.
\returns Returns the current value converted into an object identifier.

OdDAI.Select.getHandle(OdDAIObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as an object identifier.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getString(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as constant pointer to null-terminated string.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getString(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as an ANSI string.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getBoolean(OdDAI.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a boolean value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getBool(System.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a boolean value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getDouble(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a double value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getInt32(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as an unsigned 32-bit integer value.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value is successfully converted and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getADB(OdDAI.AttributeDataBlock*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a ADB.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully put to ADB and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.setAggr(OdDAI.Aggr*)
\details
Sets a new value represented with an aggregation.
\param val [in] A new nested value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setEnum(OdDAI.Enum!System.Runtime.CompilerServices.IsConst*)
\details
Sets a new value represented by OdDAI::Enum* into underlying enumeration instance.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.
\remarks
Enumeration types of val enumeration instance and select's underlying enumeration instance
must be the same in the scope of same EXPRESS schema.

OdDAI.Select.setEnum(OdDAI.EnumValueInfo!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented by OdDAI::EnumValueInfo into underlying enumeration instance.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setEnum(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented by OdAnsiString value into underlying enumeration instance.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setEnum(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets a new value represented with a unsigned long value into underlying enumeration instance.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.
\remarks
This method can be used together with early-bound enumeration values, but is not recommended in
late-bound way of working as same numerical index values of enumeration types may have different
meanings in different EXPRESS schemas.

OdDAI.Select.setDoubleArray(OdArray&lt;System.Double,OdObjectsAllocator&lt;System.Double&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an array of double values.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setHandleArray(OdArray&lt;OdDAIObjectId,OdObjectsAllocator&lt;OdDAIObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an array of object identifiers.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setInt32Array(OdArray&lt;System.Int32,OdObjectsAllocator&lt;System.Int32&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an array of unsigned 32-bit integers.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setLogical(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with a logical value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setBINARY(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with a binary value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setString(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an ANSI string.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setDouble(System.Double)
\details
Sets a new value represented with a double value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setBoolean(OdDAI.Boolean!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with a OdDAI::Boolean value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setBool(System.Boolean)
\details
Sets a new value represented with a boolean value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setInt32(System.Int32)
\details
Sets a new value represented with an unsigned 32-bit integer.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setHandle(OdDAIObjectId)
\details
Sets a new value represented as an object identifier.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setADB(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value throw a AttributeDataBlock.
\param val [in] A block with new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.type
\details
Retrieves the current underlying class description.
\returns Returns a pointer that contains the description of the underlying class.

OdDAI.Select.setUnderlyingType(OdDAI.NamedType!System.Runtime.CompilerServices.IsConst*)
\details
Sets a new name underlying type.
\param newType [in] contains the new type.
\returns Returns false if the new type is incorrect for the "Select" data type.

OdDAI.Select.underlyingTypeName(OdAnsiString)
\details
Sets a new name of the underlying type.
\param typeName [in] An ANSI string that contains the new name.
\returns Returns false if the new type name is incorrect for the "Select" data type.

OdDAI.Select.underlyingTypeName
\details
Retrieves the name of the current underlying type.
\returns Returns an ANSI string that contains the name of the underlying type.

OdDAI.Select.kind
\details
Retrieves the type of the underlying object.
\returns Returns the type of the "Select" type's underlying value.

OdDAI.Select.exists
\details
Determines whether receiver of the value is set into the "Select" instance.
\returns Returns 1 if the receiver for the value has been set.

OdDAI.Select.op_LessThan(OdDAI.Select!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The less operator for the "Select" value.
\param other [in] other value (right-hand operand of the less operator).
\returns Returns true if other greater than this, or false in other case.

OdDAI.Select.op_Inequality(OdDAI.Select!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The inequality operator for the "Select" value.
\param other [in] other value (right-hand operand of the inequality operator).
\returns Returns true if other not equals to this, or false in other case.

OdDAI.Select.op_Equality(OdDAI.Select!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The equality operator for the "Select" value.
\param other [in] other value (right-hand operand of the equality operator).
\returns Returns true if other equals to this, or false in other case.

OdDAI.Select.op_Assign(OdDAI.Select!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The assignment operator for the "Select" value.
\param other [in] Another value (right-hand operand of the assignment operation).
\returns Returns a reference to the "Select" value after the assignment operation is done.
\remarks
The operator makes a deep copy of underlying data of the right-hand operand and assigns it to this "Select" value.

OdDAI.Select.Dispose
Destroys the "Select" value.

OdDAI.Select.#ctor(OdDAI.SelectType!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new "Select" value.

OdDAI.Select.#ctor(OdDAI.Select!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new "Select" value as a copy of an existing one (copy constructor).
\param other [in] Another value to be copied.